chore: exclude plantuml for pandoc -- test perf diff
